# ПРОТОТИП

Чтобы создать **рабочий прототип** вашей трёхслойной энергопоглощающей платформы, нужен **поэтапный подход**: от упрощённой модели к полнофункциональному образцу. Ниже — чёткий план с конкретными действиями, оборудованием и критериями проверки.


---

## Этап 1. Подготовка: что нужно до начала сборки


### 1.1. Определите цель прототипа
Выберите, что именно вы хотите доказать:
- **Вариант А**: «Работает ли управление α через ρ?» → фокусируемся на вакуумной камере и датчиках.  
- **Вариант Б**: «Способен ли рассеиватель отводить тепло?» → делаем упор на тепловые трубки и охлаждение.  
- **Вариант В**: «Работает ли полный цикл?» → собираем все три слоя, но в упрощённом виде.

**Рекомендация**: начните с **Варианта А** — это быстрее и дешевле.


### 1.2. Соберите базовое ТЗ (техническое задание)
Укажите:
- Диапазон X для тестирования (например, 1–10 Дж²/с).  
- Допустимый α (например, не выше 0,1).  
- Размеры прототипа (предложите L = 0,3 м для начала).  
- Время работы (например, 5 мин непрерывного режима).  

- Критерии успеха: «α удерживается в заданных пределах», «перегрева нет».


---

## Этап 2. Материалы и компоненты (минимальный набор)


### Слой 1 (экран): упрощённый вариант
- **Материал**: пористый пенополиуретан (продаётся в строительных магазинах) или губка для мытья посуды.  
- **Механизм управления ρ**: пока **не реализуем** (на первом этапе имитируем изменение ρ, меняя образцы материала).  
- **Датчики**:  
  - Термопара типа K (хромель‑алюмель, ~300 руб./шт.).  
  - Пьезодатчик от старой звуковой колонки (~200 руб.).


### Слой 2 (вакуумная камера): базовый комплект
- **Камера**: стеклянная банка с герметичной крышкой (объём ~1 л).  
- **Вакуумный насос**: ручной насос для вакуумирования продуктов (~500 руб.) или мини‑насос 12 В (~1500 руб.).  
- **Датчики**:  
  - Манометр для вакуумных систем (0–1 бар, ~1000 руб.).  
  - Датчик температуры внутри камеры (та же термопара).  
- **Клапаны**: игольчатые клапаны от системы капельного полива (~200 руб./шт.).

### Слой 3 (рассеиватель): простейшая модель
- **Теплоотвод**: алюминиевая пластина (толщина 3–5 мм, размер 10 × 10 см).  
- **Охлаждение**: компьютерный кулер 12 В (~300 руб.).  
- **Источник тепла**: резистор 10 Ом, 10 Вт (~50 руб.) + блок питания 12 В.  
- **Датчик температуры**: вторая термопара.


### Управление и измерения
- **Контроллер**: Arduino Uno (~600 руб.) + модуль АЦП (для считывания термопар).  
- **ПО**: простая программа на C++ (пример кода ниже).  
- **Регистратор данных**: SD‑карта для Arduino (~300 руб.) или вывод в Serial Monitor.


---


## Этап 3. Сборка прототипа (пошагово)


### Шаг 1. Соберите вакуумную камеру
1. Проделайте отверстия в крышке банки для:  
   - манометра;  
   - игольчатого клапана;  
   - термопары.  
2. Герметизируйте соединения силиконом или эпоксидкой.  
3. Подключите насос к клапану.


### Шаг 2. Установите рассеиватель
1. Закрепите алюминиевую пластину на дне банки (можно на термопасте).  
2. Прикрепите кулер к пластине (скотчем или винтами).  
3. Подключите резистор к блоку питания — это имитатор «энергии X».


### Шаг 3. Подключите датчики
1. Термопара 1: в вакуумной камере (контролирует нагрев от X).  
2. Термопара 2: на алюминиевой пластине (контролирует теплоотвод).  
3. Манометр: на крышке (измеряет ρ косвенно через давление).  
4. Подключите всё к Arduino.


### Шаг 4. Напишите программу для контроллера
**Пример кода (упрощённый)**:
```cpp
#include <SPI.h>
#include <SD.h>


const int thermoPin1 = A0;  // Термопара 1 (камера)
const int thermoPin2 = A1;  // Термопара 2 (радиатор)
const int pumpPin = 9;      // Реле насоса
const int coolerPin = 10;   // Реле кулера


void setup() {
  Serial.begin(9600);
  pinMode(pumpPin, OUTPUT);
  pinMode(coolerPin, OUTPUT);
}

void loop() {
  float temp1 = analogRead(thermoPin1) * 0.00488;  // Пересчёт в градусы
  float temp2 = analogRead(thermoPin2) * 0.00488;
  
  Serial.print("Temp1: "); Serial.println(temp1);
  Serial.print("Temp2: "); Serial.println(temp2);
  
  // Если в камере жарко — включаем охлаждение
  if (temp1 > 50) {
    digitalWrite(coolerPin, HIGH);
  } else {
    digitalWrite(coolerPin, LOW);
  }
  
  delay(1000);
}
```
**Что делает код**:  
- Считывает температуру в камере и на радиаторе.  
- Включает кулер при T > 50 °C.  
- Выводит данные в монитор порта.

---

## Этап 4. Тестирование и проверка гипотезы

### Сценарий 1: Проверка управления α через ρ
1. Создайте вакуум (откачайте воздух насосом).  
2. Подавайте тепло от резистора (имитация X).  
3. Фиксируйте:  
   - температуру в камере (T₁);  
   - температуру радиатора (T₂);  
   - давление (P, косвенно ρ).  
4. Рассчитайте α по формуле:  
   $$
   \alpha = \frac{X}{\rho \cdot L^5},
   $$  
   где:  
   - X ≈ мощность резистора (например, 5 Вт = 5 Дж/с);  
   - ρ ≈ P / RT (из уравнения состояния газа, R = 287 Дж/(кг·К), T ≈ 300 К);  
   - L = 0,3 м (размер камеры).  
5. **Критерий успеха**: при снижении ρ (вакуум) α растёт, при повышении ρ (пуск воздуха) α падает.


### Сценарий 2: Проверка рассеивания тепла
1. Включите резистор на 5 Вт.  
2. Замерьте T₂ на радиаторе через 1, 2, 5 минут.  
3. **Критерий успеха**: T₂ не превышает 80 °C, тепло отводится стабильно.


---

## Этап 5. Что делать, если что‑то не работает?


### Проблема 1: Нет вакуума
- **Причина**: негерметичность соединений.  
- **Решение**: проверьте силиконом все стыки, используйте вакуумную смазку.


### Проблема 2: Температура растёт слишком быстро
- **Причина**: недостаточный теплоотвод.  
- **Решение**:  
  - увеличьте площадь радиатора;  
  - добавьте вторую термопару для контроля;  
  - включите кулер на полную мощность.


### Проблема 3: Датчики показывают шум
- **Причина**: наводки от насоса/кулера.  
- **Решение**: экранируйте провода, используйте RC‑фильтры на входах Arduino.

---

## Этап 6. Дальнейшее развитие прототипа


После успешного тестирования **базовой модели** можно усложнять:
1. **Добавьте управляемый экран**: замените губку на электроактивный полимер (например, ионно‑проводящий полимерный актюатор, IPAC).  
2. **Автоматизируйте вакуум**: свяжите манометр с Arduino и управляйте насосом по алгоритму PID.  
3. **Реализуйте дробление X**: используйте реле для импульсной подачи питания на резистор.  
4. **Расширьте датчики**: добавьте спектрометр (например, на базе фотодиода и дифракционной решётки).


---

## Бюджет и сроки


**Бюджет** (ориентировочно):  
- Материалы: ~3000 руб.  
- Электроника (Arduino, датчики
